app/controllers/cars_controller.rb

SELECT * FROM "cars" WHERE ("cars"."id" = 1)
---
  def show
    @car = Car.find(params[:id])

SELECT * FROM "cars" WHERE ("cars"."id" = 1)
---
  def edit
    @car = Car.find(params[:id])

INSERT INTO "cars" ("number", "created_at", "updated_at", "year", "model_id") VALUES(9999999, '2010-02-26 02:02:03', '2010-02-26 02:02:03', 1980, 1)
---
  def create
    @car = Car.new(params[:car])
    @models = Model.find(:all)

    respond_to do |format|
      if @car.save