app/controllers/comments_controller.rb

SELECT * FROM "cars" WHERE ("cars"."id" = 1)
INSERT INTO "comments" ("comment", "created_at", "title", "commentable_type", "commentable_id") VALUES('wtf', '2010-02-26 19:28:17', 'test', 'Car', 1)
INSERT INTO "comment_pictures" ("size", "created_at", "content_type", "thumbnail", "filename", "height", "parent_id", "comment_id", "width") VALUES(135752, '2010-02-26 19:50:17', 'image/jpeg', NULL, '_6080689.jpg', 768, NULL, 23, 1024)
---
  def post_and_upload
    @car = Car.find(params[:id])

    @comment = Comment.new(params[:comment])
    @comment.created_at = Time.now
    @car.comments << @comment

    @comment_picture = CommentPicture.new(params[:picture])
    @comment_picture.comment = @comment
    @comment_picture.save