app/controllers/manufacturers_controller.rb

  def index
    @manufacturers = Manufacturer.all
---
SELECT * FROM "manufacturers"

  def show
    @manufacturer = Manufacturer.find(params[:id])
---
SELECT * FROM "manufacturers" WHERE ("manufacturers"."id" = 1)

  def create
    @manufacturer = Manufacturer.new(params[:manufacturer])

    respond_to do |format|
      if @manufacturer.save
---
INSERT INTO "manufacturers" ("name", "created_at", "updated_at") VALUES('Ford', '2010-02-26 01:48:38', '2010-02-26 01:48:38')