app/controllers/models_controller.rb

SELECT * FROM "models"
---
  def index
    @models = Model.all

SELECT * FROM "models" WHERE ("models"."id" = 1)
---
  def show
    @model = Model.find(params[:id])

SELECT * FROM "models" WHERE ("models"."id" = 1)
---
  def edit
    @model = Model.find(params[:id])

INSERT INTO "models" ("manufacturer_id", "name", "created_at", "updated_at") VALUES(2, 'Caprice', '2010-02-26 01:57:27', '2010-02-26 01:57:27')
---
  def create
    @model = Model.new(params[:model])

    respond_to do |format|
      if @model.save